//
//  Characters.swift
//  Manabu
//
//  Created by Luke on 19/01/2026.
//

import Foundation

let hiraganaDict: [String: String] = [
    // Vowels
    "あ": "a",
    "い": "i",
    "う": "u",
    "え": "e",
    "お": "o",

    // K
    "か": "ka",
    "き": "ki",
    "く": "ku",
    "け": "ke",
    "こ": "ko",
    "が": "ga",
    "ぎ": "gi",
    "ぐ": "gu",
    "げ": "ge",
    "ご": "go",

    // S
    "さ": "sa",
    "し": "shi",
    "す": "su",
    "せ": "se",
    "そ": "so",
    "ざ": "za",
    "じ": "ji",
    "ず": "zu",
    "ぜ": "ze",
    "ぞ": "zo",

    // T
    "た": "ta",
    "ち": "chi",
    "つ": "tsu",
    "て": "te",
    "と": "to",
    "だ": "da",
    "ぢ": "ji",
    "づ": "zu",
    "で": "de",
    "ど": "do",

    // N
    "な": "na",
    "に": "ni",
    "ぬ": "nu",
    "ね": "ne",
    "の": "no",

    // H
    "は": "ha",
    "ひ": "hi",
    "ふ": "fu",
    "へ": "he",
    "ほ": "ho",
    "ば": "ba",
    "び": "bi",
    "ぶ": "bu",
    "べ": "be",
    "ぼ": "bo",
    "ぱ": "pa",
    "ぴ": "pi",
    "ぷ": "pu",
    "ぺ": "pe",
    "ぽ": "po",

    // M
    "ま": "ma",
    "み": "mi",
    "む": "mu",
    "め": "me",
    "も": "mo",

    // Y
    "や": "ya",
    "ゆ": "yu",
    "よ": "yo",

    // R
    "ら": "ra",
    "り": "ri",
    "る": "ru",
    "れ": "re",
    "ろ": "ro",

    
    // W
    "わ": "wa",
    "を": "wo",

    // Special
    "ん": "n",

    // Small characters
    "ゃ": "ya",
    "ゅ": "yu",
    "ょ": "yo",
    "っ": "small tsu (consonant pause)",
    "ぁ": "a",
    "ぃ": "i",
    "ぅ": "u",
    "ぇ": "e",
    "ぉ": "o"
]


let katakanaDict: [String: String] = [
    // Vowels
    "ア": "a", "イ": "i", "ウ": "u", "エ": "e", "オ": "o",

    // K
    "カ": "ka", "キ": "ki", "ク": "ku", "ケ": "ke", "コ": "ko",
    "キャ": "kya", "キュ": "kyu", "キョ": "kyo",

    // S
    "サ": "sa", "シ": "shi", "ス": "su", "セ": "se", "ソ": "so",
    "シャ": "sha", "シュ": "shu", "ショ": "sho",

    // T
    "タ": "ta", "チ": "chi", "ツ": "tsu", "テ": "te", "ト": "to",
    "チャ": "cha", "チュ": "chu", "チョ": "cho",

    // N
    "ナ": "na", "ニ": "ni", "ヌ": "nu", "ネ": "ne", "ノ": "no",

    // H
    "ハ": "ha", "ヒ": "hi", "フ": "fu", "ヘ": "he", "ホ": "ho",
    "ファ": "fa", "フィ": "fi", "フェ": "fe", "フォ": "fo",

    // M
    "マ": "ma", "ミ": "mi", "ム": "mu", "メ": "me", "モ": "mo",

    // Y
    "ヤ": "ya", "ユ": "yu", "ヨ": "yo",

    // R
    "ラ": "ra", "リ": "ri", "ル": "ru", "レ": "re", "ロ": "ro",

    // W
    "ワ": "wa", "ヲ": "wo",

    // G
    "ガ": "ga", "ギ": "gi", "グ": "gu", "ゲ": "ge", "ゴ": "go",
    "ギャ": "gya", "ギュ": "gyu", "ギョ": "gyo",

    // Z / J
    "ザ": "za", "ジ": "ji", "ズ": "zu", "ゼ": "ze", "ゾ": "zo",
    "ジャ": "ja", "ジュ": "ju", "ジョ": "jo",

    // D / B / P
    "ダ": "da", "デ": "de", "ド": "do",
    "バ": "ba", "ビ": "bi", "ブ": "bu", "ベ": "be", "ボ": "bo",
    "パ": "pa", "ピ": "pi", "プ": "pu", "ペ": "pe", "ポ": "po",

    // Special
    "ン": "n",

    // Long vowel marker
    "ー": "-"
]
